Repository: avgeek-oss/dnsdeck
Catalog: DNSDeck/Localizable.xcstrings
Source language: en
Languages: de, es, fr, hi, id, ja, ko, pl, pt_br, tr, uk, vi, zh_hans, zh_hant

source: Tenant ID
de: Mieter-ID
es: ID de inquilino
fr: ID du locataire
hi: किरायेदार आईडी
id: ID Penyewa
ja: テナントID
ko: 테넌트 ID
pl: Identyfikator najemcy
pt_br: ID do locatário
tr: Kiracı Kimliği
uk: ID орендаря
vi: ID người thuê
zh_hans: 租户ID
zh_hant: 租戶ID

source: The numeric ID shown after /a/ in the DNSimple application URL.
de: Die numerische ID, die nach /a/ in der DNSimple-Anwendungs-URL angezeigt wird.
es: El ID numérico que se muestra después de /a/ en la URL de la aplicación DNSimple.
fr: L'ID numérique affiché après /a/ dans l'URL de l'application DNSimple.
hi: DNSSimple एप्लिकेशन URL में /a/ के बाद दिखाई गई संख्यात्मक आईडी।
id: ID numerik yang ditampilkan setelah /a/ di URL aplikasi DNSimple.
ja: DNSimple アプリケーション URL の /a/ の後に表示される数値 ID。
ko: DNSimple 애플리케이션 URL에서 /a/ 뒤에 표시되는 숫자 ID입니다.
pl: Identyfikator liczbowy wyświetlany po /a/ w adresie URL aplikacji DNSimple.
pt_br: O ID numérico mostrado após /a/ na URL do aplicativo DNSimple.
tr: DNSimple uygulama URL'sinde /a/ sonrasında gösterilen sayısal kimlik.
uk: Числовий ідентифікатор, показаний після /a/ в URL-адресі програми DNSimple.
vi: ID số được hiển thị sau /a/ trong URL ứng dụng DNSimple.
zh_hans: DNSimple 应用程序 URL 中 /a/ 后显示的数字 ID。
zh_hant: DNSimple 應用程式 URL 中 /a/ 後顯示的數字 ID。

source: The zone has been added. To complete the activation, you would need to copy the name servers and add it to your domain provider.
de: Die Zone wurde hinzugefügt. Um die Aktivierung abzuschließen, müssen Sie die Nameserver kopieren und zu Ihrem Domain-Anbieter hinzufügen.
es: La zona ha sido agregada. Para completar la activación, deberá copiar los servidores de nombres y agregarlos a su proveedor de dominio.
fr: La zone a été ajoutée. Pour terminer l'activation, vous devrez copier les serveurs de noms et les ajouter à votre fournisseur de domaine.
hi: जोन जोड़ दिया गया है. सक्रियण पूरा करने के लिए, आपको नाम सर्वर की प्रतिलिपि बनाना होगा और इसे अपने डोमेन प्रदाता में जोड़ना होगा।
id: Zona telah ditambahkan. Untuk menyelesaikan aktivasi, Anda perlu menyalin server nama dan menambahkannya ke penyedia domain Anda.
ja: ゾーンが追加されました。アクティベーションを完了するには、ネーム サーバーをコピーし、ドメイン プロバイダーに追加する必要があります。
ko: 영역이 추가되었습니다. 활성화를 완료하려면 이름 서버를 복사하여 도메인 공급자에 추가해야 합니다.
pl: Strefa została dodana. Aby dokończyć aktywację, musisz skopiować serwery nazw i dodać je do swojego dostawcy domeny.
pt_br: A zona foi adicionada. Para concluir a ativação, você precisará copiar os servidores de nomes e adicioná-los ao seu provedor de domínio.
tr: Bölge eklendi. Etkinleştirmeyi tamamlamak için ad sunucularını kopyalayıp alan adı sağlayıcınıza eklemeniz gerekir.
uk: Зона додана. Щоб завершити активацію, вам потрібно скопіювати сервери імен і додати їх до постачальника домену.
vi: Khu vực đã được thêm vào. Để hoàn tất quá trình kích hoạt, bạn cần sao chép máy chủ định danh và thêm nó vào nhà cung cấp tên miền của mình.
zh_hans: 该区域已添加。要完成激活，您需要复制名称服务器并将其添加到您的域提供商。
zh_hant: 該區域已新增。要完成激活，您需要複製名稱伺服器並將其添加到您的網域提供者。

source: This record will be deleted and cannot be reversed.
de: Dieser Datensatz wird gelöscht und kann nicht rückgängig gemacht werden.
es: Este registro se eliminará y no se podrá revertir.
fr: Cet enregistrement sera supprimé et ne pourra pas être annulé.
hi: यह रिकॉर्ड हटा दिया जाएगा और इसे उलटा नहीं किया जा सकेगा.
id: Catatan ini akan dihapus dan tidak dapat dibatalkan.
ja: この記録は削除され、元に戻すことはできません。
ko: 이 기록은 삭제되며 되돌릴 수 없습니다.
pl: Ten rekord zostanie usunięty i nie będzie można go cofnąć.
pt_br: Este registro será excluído e não poderá ser revertido.
tr: Bu kayıt silinecek ve geri alınamayacaktır.
uk: Цей запис буде видалено, і його неможливо скасувати.
vi: Bản ghi này sẽ bị xóa và không thể đảo ngược.
zh_hans: 该记录将被删除且无法撤销。
zh_hant: 該記錄將被刪除且無法撤銷。

source: This will remove your %@ credentials. You can reconnect at any time.
de: Dadurch werden Ihre %@-Anmeldeinformationen entfernt. Sie können die Verbindung jederzeit wiederherstellen.
es: Esto eliminará sus credenciales %@. Puedes volver a conectarte en cualquier momento.
fr: Cela supprimera vos informations d'identification %@. Vous pouvez vous reconnecter à tout moment.
hi: यह आपके %@ क्रेडेंशियल्स को हटा देगा। आप किसी भी समय पुनः कनेक्ट कर सकते हैं.
id: Ini akan menghapus kredensial %@ Anda. Anda dapat menyambung kembali kapan saja.
ja: これにより、%@ 資格情報が削除されます。いつでも再接続できます。
ko: 이렇게 하면 %@ 자격 증명이 제거됩니다. 언제든지 다시 연결할 수 있습니다.
pl: Spowoduje to usunięcie poświadczeń %@. Możesz połączyć się ponownie w dowolnym momencie.
pt_br: Isso removerá suas credenciais %@. Você pode se reconectar a qualquer momento.
tr: Bu, %@ kimlik bilgilerinizi kaldıracaktır. İstediğiniz zaman yeniden bağlanabilirsiniz.
uk: Це видалить ваші облікові дані %@. Ви можете будь-коли повторно підключитися.
vi: Thao tác này sẽ xóa thông tin đăng nhập %@ của bạn. Bạn có thể kết nối lại bất cứ lúc nào.
zh_hans: 这将删除您的 %@ 凭据。您可以随时重新连接。
zh_hant: 這將刪除您的 %@ 憑證。您可以隨時重新連線。

source: This zone doesn't have any DNS records yet.
de: Diese Zone verfügt noch über keine DNS-Einträge.
es: Esta zona aún no tiene ningún registro DNS.
fr: Cette zone n'a pas encore d'enregistrement DNS.
hi: इस ज़ोन में अभी तक कोई DNS रिकॉर्ड नहीं है।
id: Zona ini belum memiliki data DNS apa pun.
ja: このゾーンにはまだ DNS レコードがありません。
ko: 이 영역에는 아직 DNS 레코드가 없습니다.
pl: Ta strefa nie ma jeszcze żadnych rekordów DNS.
pt_br: Esta zona ainda não possui registros DNS.
tr: Bu bölgede henüz DNS kaydı yok.
uk: Ця зона ще не має записів DNS.
vi: Vùng này chưa có bất kỳ bản ghi DNS nào.
zh_hans: 该区域还没有任何 DNS 记录。
zh_hant: 該區域還沒有任何 DNS 記錄。

source: Too many records in CSV file (%lld). Maximum allowed is 1000.
de: Zu viele Datensätze in der CSV-Datei (%lld). Der maximal zulässige Wert beträgt 1000.
es: Demasiados registros en el archivo CSV (%lld). El máximo permitido es 1000.
fr: Trop d'enregistrements dans le fichier CSV (%lld). Le maximum autorisé est de 1 000.
hi: CSV फ़ाइल (%lld) में बहुत सारे रिकॉर्ड हैं। अधिकतम अनुमत 1000 है.
id: Terlalu banyak catatan dalam file CSV (%lld). Maksimum yang diperbolehkan adalah 1000.
ja: CSV ファイル (%lld) 内のレコードが多すぎます。許可される最大値は 1000 です。
ko: CSV 파일(%lld)에 레코드가 너무 많습니다. 허용되는 최대값은 1000입니다.
pl: Zbyt wiele rekordów w pliku CSV (%lld). Maksymalna dozwolona liczba to 1000.
pt_br: Muitos registros no arquivo CSV (%lld). O máximo permitido é 1000.
tr: CSV dosyasında (%lld) çok fazla kayıt var. İzin verilen maksimum sayı 1000'dir.
uk: Забагато записів у файлі CSV (%lld). Максимально допустима кількість – 1000.
vi: Quá nhiều bản ghi trong tệp CSV (%lld). Số lượng tối đa cho phép là 1000.
zh_hans: CSV 文件 (%lld) 中的记录过多。允许的最大值为 1000。
zh_hant: CSV 檔案 (%lld) 中的記錄過多。允許的最大值為 1000。

source: Traffic is proxied through Cloudflare
de: Der Datenverkehr wird über Cloudflare weitergeleitet
es: El tráfico se envía a través de Cloudflare
fr: Le trafic est proxy via Cloudflare
hi: क्लाउडफ़ेयर के माध्यम से ट्रैफ़िक को प्रॉक्सी किया जाता है
id: Lalu lintas diproksi melalui Cloudflare
ja: トラフィックはCloudflareを介してプロキシされます
ko: 트래픽은 Cloudflare를 통해 프록시됩니다.
pl: Ruch jest przekazywany przez Cloudflare
pt_br: O tráfego é proxy através do Cloudflare
tr: Trafik Cloudflare üzerinden proxy olarak yönetiliyor
uk: Трафік проксується через Cloudflare
vi: Lưu lượng truy cập được ủy quyền thông qua Cloudflare
zh_hans: 流量通过 Cloudflare 代理
zh_hant: 流量透過 Cloudflare 代理

source: Transferred
de: Übertragen
es: Transferido
fr: Transféré
hi: स्थानांतरित
id: Ditransfer
ja: 転送されました
ko: 전송됨
pl: Przeniesiony
pt_br: Transferido
tr: Aktarıldı
uk: Перенесено
vi: Đã chuyển
zh_hans: 已转入
zh_hant: 已轉入

source: Type
de: Typ
es: Tipo
fr: Tapez
hi: प्रकार
id: Ketik
ja: 種類
ko: 유형
pl: Wpisz
pt_br: Tipo
tr: Tür
uk: Тип
vi: Loại
zh_hans: 类型
zh_hant: 類型

source: UltraDNS accepts RRset TTLs from 0 through 2147483647 seconds.
de: UltraDNS akzeptiert RRset-TTLs von 0 bis 2147483647 Sekunden.
es: UltraDNS acepta RRset TTL de 0 a 2147483647 segundos.
fr: UltraDNS accepte les TTL RRset de 0 à 2147483647 secondes.
hi: UltraDNS 0 से 2147483647 सेकंड तक RRset TTL स्वीकार करता है।
id: UltraDNS menerima RRset TTL dari 0 hingga 2147483647 detik.
ja: UltraDNS は、0 ～ 2147483647 秒の RRset TTL を受け入れます。
ko: UltraDNS는 0~2147483647초의 RRset TTL을 허용합니다.
pl: UltraDNS akceptuje wartości RRset TTL od 0 do 2147483647 sekund.
pt_br: UltraDNS aceita TTLs RRset de 0 a 2147483647 segundos.
tr: UltraDNS, 0 ila 2147483647 saniye arasındaki RRset TTL'leri kabul eder.
uk: UltraDNS приймає RRset TTL від 0 до 2147483647 секунд.
vi: UltraDNS chấp nhận TTL RRset từ 0 đến 2147483647 giây.
zh_hans: UltraDNS 接受从 0 到 2147483647 秒的 RRset TTL。
zh_hant: UltraDNS 接受從 0 到 2147483647 秒的 RRset TTL。

source: Unable to Create Zone
de: Zone kann nicht erstellt werden
es: No se puede crear zona
fr: Impossible de créer une zone
hi: ज़ोन बनाने में असमर्थ
id: Tidak Dapat Membuat Zona
ja: ゾーンを作成できません
ko: 영역을 생성할 수 없습니다.
pl: Nie można utworzyć strefy
pt_br: Não é possível criar zona
tr: Bölge Oluşturulamıyor
uk: Не вдалося створити зону
vi: Không thể tạo vùng
zh_hans: 无法创建区域
zh_hant: 無法建立區域

source: Unable to authenticate. Please try again.
de: Authentifizierung nicht möglich. Bitte versuchen Sie es erneut.
es: No se puede autenticar. Por favor inténtalo de nuevo.
fr: Impossible de s'authentifier. Veuillez réessayer.
hi: प्रमाणित करने में असमर्थ. कृपया पुन: प्रयास करें।
id: Tidak dapat mengautentikasi. Silakan coba lagi.
ja: 認証できません。もう一度試してください。
ko: 인증할 수 없습니다. 다시 시도해 주세요.
pl: Nie można uwierzytelnić. Spróbuj ponownie.
pt_br: Não foi possível autenticar. Por favor, tente novamente.
tr: Kimlik doğrulaması yapılamıyor. Lütfen tekrar deneyin.
uk: Не вдалося автентифікувати. Спробуйте ще раз.
vi: Không thể xác thực. Vui lòng thử lại.
zh_hans: 无法验证。请再试一次。
zh_hant: 無法驗證。請再試一次。

source: Unavailable
de: Nicht verfügbar
es: No disponible
fr: Indisponible
hi: अनुपलब्ध
id: Tidak tersedia
ja: 利用不可
ko: 이용 불가
pl: Niedostępne
pt_br: Indisponível
tr: Kullanılamıyor
uk: Недоступний
vi: Không có sẵn
zh_hans: 不可用
zh_hant: 不可用

source: Unlock
de: Entsperren
es: Desbloquear
fr: Déverrouiller
hi: अनलॉक
id: Buka kunci
ja: ロックを解除する
ko: 잠금 해제
pl: Odblokuj
pt_br: Desbloquear
tr: Kilidi aç
uk: Розблокувати
vi: Mở khóa
zh_hans: 解锁
zh_hant: 解鎖

source: Update
de: Aktualisieren
es: Actualizar
fr: Mise à jour
hi: अद्यतन करें
id: Pembaruan
ja: アップデート
ko: 업데이트
pl: Aktualizacja
pt_br: Atualizar
tr: Güncelleme
uk: оновлення
vi: cập nhật
zh_hans: 更新
zh_hant: 更新

source: Update Nameservers
de: Nameserver aktualisieren
es: Actualizar servidores de nombres
fr: Mettre à jour les serveurs de noms
hi: नेमसर्वर अपडेट करें
id: Perbarui Server Nama
ja: ネームサーバーの更新
ko: 네임서버 업데이트
pl: Zaktualizuj serwery nazw
pt_br: Atualizar servidores de nomes
tr: Ad Sunucularını Güncelle
uk: Оновіть сервери імен
vi: Cập nhật máy chủ tên
zh_hans: 更新域名服务器
zh_hant: 更新網域名稱伺服器

source: Update Nameservers…
de: Nameserver aktualisieren…
es: Actualizar servidores de nombres...
fr: Mettre à jour les serveurs de noms…
hi: नेमसर्वर अपडेट करें...
id: Perbarui Server Nama…
ja: ネームサーバーを更新…
ko: 네임서버 업데이트…
pl: Zaktualizuj serwery nazw…
pt_br: Atualizar servidores de nomes…
tr: Ad Sunucularını Güncelleyin…
uk: Оновити сервери імен…
vi: Cập nhật máy chủ tên…
zh_hans: 更新域名服务器...
zh_hant: 更新網域名稱伺服器...

source: Use DNSDeck's local MCP companion from a client that supports STDIO. Connect providers in DNSDeck, then paste this command into the client.
de: Verwenden Sie den lokalen MCP-Begleiter von DNSDeck von einem Client, der STDIO unterstützt. Verbinden Sie Anbieter in DNSDeck und fügen Sie diesen Befehl dann in den Client ein.
es: Utilice el complemento MCP local de DNSDeck desde un cliente que admita STDIO. Conecte proveedores en DNSDeck, luego pegue este comando en el cliente.
fr: Utilisez le compagnon MCP local de DNSDeck à partir d'un client prenant en charge STDIO. Connectez les fournisseurs dans DNSDeck, puis collez cette commande dans le client.
hi: STDIO का समर्थन करने वाले क्लाइंट से DNSDeck के स्थानीय MCP साथी का उपयोग करें। DNSDeck में प्रदाताओं को कनेक्ट करें, फिर इस कमांड को क्लाइंट में पेस्ट करें।
id: Gunakan pendamping MCP lokal DNSDeck dari klien yang mendukung STDIO. Hubungkan penyedia di DNSDeck, lalu tempelkan perintah ini ke klien.
ja: STDIO をサポートするクライアントから DNSDeck のローカル MCP コンパニオンを使用します。 DNSDeck でプロバイダーに接続し、このコマンドをクライアントに貼り付けます。
ko: STDIO를 지원하는 클라이언트에서 DNSDeck의 로컬 MCP 도우미를 사용하세요. DNSDeck에서 공급자를 연결한 후 이 명령을 클라이언트에 붙여넣습니다.
pl: Użyj lokalnego towarzysza MCP DNSDeck z klienta obsługującego STDIO. Połącz dostawców w DNSDeck, a następnie wklej to polecenie do klienta.
pt_br: Use o complemento MCP local do DNSDeck de um cliente que suporte STDIO. Conecte os provedores no DNSDeck e cole este comando no cliente.
tr: STDIO'yu destekleyen bir istemciden DNSDeck'in yerel MCP yardımcısını kullanın. Sağlayıcıları DNSDeck'e bağlayın, ardından bu komutu istemciye yapıştırın.
uk: Використовуйте локальний компаньйон MCP DNSDeck із клієнта, який підтримує STDIO. Підключіть постачальників у DNSDeck, а потім вставте цю команду в клієнт.
vi: Sử dụng đồng hành MCP cục bộ của DNSDeck từ máy khách hỗ trợ STDIO. Kết nối các nhà cung cấp trong DNSDeck, sau đó dán lệnh này vào máy khách.
zh_hans: 从支持 STDIO 的客户端使用 DNSDeck 的本地 MCP 伴侣。连接 DNSDeck 中的提供商，然后将此命令粘贴到客户端中。
zh_hant: 從支援 STDIO 的用戶端使用 DNSDeck 的本機 MCP 伴侶。連接 DNSDeck 中的提供者，然後將此命令貼到客戶端。

source: Use a DNSimple account access token and numeric account ID. DNSDeck scopes record writes to DNSimple itself rather than propagating them to integrated zones.
de: Verwenden Sie ein DNSimple-Kontozugriffstoken und eine numerische Konto-ID. DNSDeck beschränkt Datensatzschreibvorgänge auf DNSimple selbst, anstatt sie an integrierte Zonen weiterzuleiten.
es: Utilice un token de acceso a cuenta DNSimple y un ID de cuenta numérico. DNSDeck abarca las escrituras de registros en el propio DNSimple en lugar de propagarlas a zonas integradas.
fr: Utilisez un jeton d'accès au compte DNSimple et un identifiant de compte numérique. DNSDeck enregistre les écritures dans DNSimple lui-même plutôt que de les propager aux zones intégrées.
hi: DNSSimple खाता एक्सेस टोकन और संख्यात्मक खाता आईडी का उपयोग करें। DNSDeck स्कोप रिकॉर्ड एकीकृत क्षेत्रों में प्रचारित करने के बजाय DNSimple को ही लिखता है।
id: Gunakan token akses akun DNSimple dan ID akun numerik. Catatan cakupan DNSDeck menulis ke DNSimple itu sendiri daripada menyebarkannya ke zona terintegrasi.
ja: DNSimple アカウントのアクセス トークンと数値のアカウント ID を使用します。 DNSDeck スコープは、統合ゾーンに書き込みを伝播するのではなく、DNSimple 自体への書き込みを記録します。
ko: DNSimple 계정 액세스 토큰과 숫자 계정 ID를 사용하세요. DNSDeck 범위는 쓰기를 통합 영역에 전파하는 대신 DNSimple 자체에 기록합니다.
pl: Użyj tokena dostępu do konta DNSimple i numerycznego identyfikatora konta. Zakresy DNSDeck zapisują rekordy w samym DNSimple, zamiast propagować je do zintegrowanych stref.
pt_br: Use um token de acesso à conta DNSimple e um ID numérico da conta. Os escopos do DNSDeck registram gravações no próprio DNSimple, em vez de propagá-las para zonas integradas.
tr: DNSimple hesap erişim belirtecini ve sayısal hesap kimliğini kullanın. DNSDeck, kayıt kayıtlarını tümleşik bölgelere yaymak yerine DNSimple'ın kendisine yazar.
uk: Використовуйте маркер доступу до облікового запису DNSimple і числовий ідентифікатор облікового запису. DNSDeck охоплює записи записів у сам DNSimple, а не поширює їх до інтегрованих зон.
vi: Sử dụng mã thông báo truy cập tài khoản DNSimple và ID tài khoản dạng số. Bản ghi phạm vi DNSDeck ghi vào chính DNSimple thay vì truyền chúng đến các vùng tích hợp.
zh_hans: 使用 DNSimple 帐户访问令牌和数字帐户 ID。 DNSDeck 范围记录写入 DNSimple 本身，而不是将它们传播到集成区域。
zh_hant: 使用 DNSimple 帳戶存取令牌和數位帳戶 ID。 DNSDeck 範圍記錄寫入 DNSimple 本身，而不是將它們傳播到整合區域。

source: Use a Linode API personal access token with domains read-only or read-write scope. DNS zones are served only while the account has an active Linode.
de: Verwenden Sie ein persönliches Linode-API-Zugriffstoken mit schreibgeschütztem oder schreibgeschütztem Domänenbereich. DNS-Zonen werden nur bedient, solange das Konto über einen aktiven Linode verfügt.
es: Utilice un token de acceso personal de la API de Linode con dominios de solo lectura o alcance de lectura y escritura. Las zonas DNS se sirven solo mientras la cuenta tiene un Linode activo.
fr: Utilisez un jeton d'accès personnel de l'API Linode avec des domaines en lecture seule ou en lecture-écriture. Les zones DNS ne sont servies que lorsque le compte dispose d'un Linode actif.
hi: केवल पढ़ने-लिखने या पढ़ने-लिखने के दायरे वाले डोमेन के साथ लिनोड एपीआई व्यक्तिगत एक्सेस टोकन का उपयोग करें। DNS ज़ोन केवल तभी परोसे जाते हैं जब खाते में सक्रिय लिनोड हो।
id: Gunakan token akses pribadi Linode API dengan cakupan domain baca-saja atau baca-tulis. Zona DNS hanya dilayani ketika akun memiliki Linode aktif.
ja: Linode API パーソナル アクセス トークンをドメイン読み取り専用または読み取り/書き込みスコープで使用します。 DNS ゾーンは、アカウントにアクティブな Linode がある間のみ提供されます。
ko: 도메인 읽기 전용 또는 읽기-쓰기 범위와 함께 Linode API 개인 액세스 토큰을 사용하십시오. DNS 영역은 계정에 활성 Linode가 있는 동안에만 제공됩니다.
pl: Użyj osobistego tokena dostępu Linode API z zakresem domeny tylko do odczytu lub do odczytu i zapisu. Strefy DNS są obsługiwane tylko wtedy, gdy na koncie jest aktywny Linode.
pt_br: Use um token de acesso pessoal da API Linode com escopo somente leitura ou leitura-gravação de domínios. As zonas DNS são servidas apenas enquanto a conta tem um Linode activo.
tr: Alan adlarının salt okunur veya okuma-yazma kapsamına sahip bir Linode API kişisel erişim belirtecini kullanın. DNS bölgeleri yalnızca hesapta etkin bir Linode varken sunulur.
uk: Використовуйте особистий маркер доступу Linode API із доменами, доступними лише для читання або читання-запису. Зони DNS обслуговуються лише тоді, коли обліковий запис має активний Linode.
vi: Sử dụng mã thông báo truy cập cá nhân API Linode với phạm vi chỉ đọc hoặc đọc-ghi của miền. Vùng DNS chỉ được phục vụ khi tài khoản có Linode đang hoạt động.
zh_hans: 使用具有只读或读写范围域的 Linode API 个人访问令牌。 DNS 区域仅在帐户具有活动 Linode 时提供服务。
zh_hant: 使用具有唯讀或讀寫範圍網域的 Linode API 個人存取權杖。 DNS 區域僅在帳戶具有活動 Linode 時提供服務。

source: Use a Microsoft Entra service principal scoped to the public DNS zones DNSDeck should manage. Subscription-wide discovery includes zones in every resource group; a default resource group is only needed when creating a zone.
de: Verwenden Sie einen Microsoft Entra-Dienstprinzipal, der auf die öffentlichen DNS-Zonen beschränkt ist, die DNSDeck verwalten soll. Die abonnementweite Erkennung umfasst Zonen in jeder Ressourcengruppe. Eine Standardressourcengruppe ist nur beim Erstellen einer Zone erforderlich.
es: Utilice una entidad de servicio de Microsoft Entra con ámbito de las zonas DNS públicas que DNSDeck debe administrar. El descubrimiento en toda la suscripción incluye zonas en cada grupo de recursos; un grupo de recursos predeterminado solo es necesario al crear una zona.
fr: Utilisez un principal de service Microsoft Entra limité aux zones DNS publiques que DNSDeck doit gérer. La découverte à l'échelle de l'abonnement inclut des zones dans chaque groupe de ressources ; un groupe de ressources par défaut n'est nécessaire que lors de la création d'une zone.
hi: सार्वजनिक DNS ज़ोन DNSDeck को प्रबंधित करने के लिए Microsoft Entra सेवा प्रिंसिपल का उपयोग करें। सदस्यता-व्यापी खोज में प्रत्येक संसाधन समूह में क्षेत्र शामिल हैं; ज़ोन बनाते समय एक डिफ़ॉल्ट संसाधन समूह की आवश्यकता होती है।
id: Gunakan perwakilan layanan Microsoft Entra yang tercakup dalam zona DNS publik yang harus dikelola DNSDeck. Penemuan seluruh langganan mencakup zona di setiap grup sumber daya; grup sumber daya default hanya diperlukan saat membuat zona.
ja: DNSDeck が管理するパブリック DNS ゾーンをスコープとする Microsoft Entra サービス プリンシパルを使用します。サブスクリプション全体の検出には、すべてのリソース グループのゾーンが含まれます。デフォルトのリソース グループは、ゾーンを作成する場合にのみ必要になります。
ko: DNSDeck이 관리해야 하는 공용 DNS 영역으로 범위가 지정된 Microsoft Entra 서비스 주체를 사용하세요. 구독 전체 검색에는 모든 리소스 그룹의 영역이 포함됩니다. 기본 리소스 그룹은 영역을 생성할 때만 필요합니다.
pl: Użyj jednostki usługi Microsoft Entra obejmującej publiczne strefy DNS, którymi powinien zarządzać DNSDeck. Wykrywanie obejmujące całą subskrypcję obejmuje strefy w każdej grupie zasobów; domyślna grupa zasobów jest potrzebna tylko podczas tworzenia strefy.
pt_br: Use uma entidade de serviço Microsoft Entra com escopo definido para as zonas DNS públicas que o DNSDeck deve gerenciar. A descoberta em toda a assinatura inclui zonas em cada grupo de recursos; um grupo de recursos padrão só é necessário ao criar uma zona.
tr: DNSDeck'in yönetmesi gereken genel DNS bölgeleri kapsamına alınmış bir Microsoft Entra hizmet sorumlusu kullanın. Abonelik çapında keşif, her kaynak grubundaki bölgeleri içerir; varsayılan kaynak grubuna yalnızca bölge oluşturulurken ihtiyaç duyulur.
uk: Використовуйте принципала-службу Microsoft Entra, призначеного для загальнодоступних зон DNS, якими має керувати DNSDeck. Виявлення на рівні підписки включає зони в кожній групі ресурсів; група ресурсів за замовчуванням потрібна лише під час створення зони.
vi: Sử dụng dịch vụ chính của Microsoft Entra trong phạm vi vùng DNS công cộng mà DNSDeck sẽ quản lý. Khám phá trên toàn bộ đăng ký bao gồm các vùng trong mọi nhóm tài nguyên; một nhóm tài nguyên mặc định chỉ cần thiết khi tạo một vùng.
zh_hans: 使用范围为 DNSDeck 应管理的公共 DNS 区域的 Microsoft Entra 服务主体。订阅范围内的发现包括每个资源组中的区域；仅在创建区域时才需要默认资源组。
zh_hant: 使用範圍為 DNSDeck 應管理的公共 DNS 區域的 Microsoft Entra 服務主體。訂閱範圍內的發現包括每個資源組中的區域；僅在建立區域時才需要預設資源組。
